In [77]:
from typing import List 
import pandas as pd

In [78]:
names = ["Nate", "John", "Jane", "Mandy"]
age = [39, 23, 31, 25]
sex = ["m", "m", "f", "f"]
email = ["nate@gmail.com", "john@gmail.com", "jane@gmail.com", "mandy@gmail.com"]
purchases = [34, 12, 42, 8]

people = {
    "name" : names, 
    "age" : age, 
    "sex" : sex, 
    "email" : email,
    "purchases" : purchases 
}

people_df = pd.DataFrame(people)
people_df

    name  age sex            email  purchases
0   Nate   39   m   nate@gmail.com         34
1   John   23   m   john@gmail.com         12
2   Jane   31   f   jane@gmail.com         42
3  Mandy   25   f  mandy@gmail.com          8

In [79]:
people_df = people_df.rename(columns={"sex" : "gender"})
people_df

    name  age gender            email  purchases
0   Nate   39      m   nate@gmail.com         34
1   John   23      m   john@gmail.com         12
2   Jane   31      f   jane@gmail.com         42
3  Mandy   25      f  mandy@gmail.com          8

In [80]:
people_df["active"] = [True, True, True, True]
people_df

    name  age gender            email  purchases  active
0   Nate   39      m   nate@gmail.com         34    True
1   John   23      m   john@gmail.com         12    True
2   Jane   31      f   jane@gmail.com         42    True
3  Mandy   25      f  mandy@gmail.com          8    True

In [81]:
people_df[["name", "email"]]

    name            email
0   Nate   nate@gmail.com
1   John   john@gmail.com
2   Jane   jane@gmail.com
3  Mandy  mandy@gmail.com

In [82]:
people_df["purchases"] = people_df["purchases"] + 5
people_df

    name  age gender            email  purchases  active
0   Nate   39      m   nate@gmail.com         39    True
1   John   23      m   john@gmail.com         17    True
2   Jane   31      f   jane@gmail.com         47    True
3  Mandy   25      f  mandy@gmail.com         13    True

In [83]:
people_df.loc[people_df["purchases"]> 20]

   name  age gender           email  purchases  active
0  Nate   39      m  nate@gmail.com         39    True
2  Jane   31      f  jane@gmail.com         47    True

In [ ]:
people_df.loc[people_df["gender"] == "m", "gender"] = "male" 
people_df.loc[people_df["gender"] == "f", "gender"] = "female"
people_df

    name  age  gender            email  purchases  active
0   Nate   39    male   nate@gmail.com         39    True
1   John   23    male   john@gmail.com         17    True
2   Jane   31  female   jane@gmail.com         47    True
3  Mandy   25  female  mandy@gmail.com         13    True